## Relatório de Análise 6
Crie váriaveis: 'Valor Bruto', 'Valor m2', 'Valor Bruto m2', 'Tipo Agregado'

In [1]:
import pandas as pd
df = pd.read_csv('dados/aluguel_residencial_t.csv', sep=';')
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0

In [2]:
df['Valor Bruto'] = df['Valor'] + df['Condominio'] + df['IPTU']
df['Valor m2'] = (df['Valor']/df['Area']).round(2)
df['Valor Bruto m2'] = (df['Valor Bruto']/df['Area']).round(2)
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00,70.00
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67,21.46
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00,32.36

In [8]:
#Tipo Agregado - Casa ou Apartamento
df['Tipo'].unique()
casa = ['Casa', 'Casa de Condomínio', 'Casa de Vila']

array(['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio',
       'Casa de Vila'], dtype=object)

In [9]:
df['Tipo Agregado'] = df['Tipo'].apply(lambda x: 'Casa' if x in casa else 'Apartamento')
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Valor Bruto m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,56.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,80.67,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67,21.46,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00,32.36,Apartamento

Exclua usando del, pop, drop()

In [10]:
del df['Valor Bruto m2']
df.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0,2260.0,42.50,Apartamento
1,Casa,Jardim Botânico,2,0,1,100,7000.0,0.0,0.0,7000.0,70.00,Casa
2,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,1210.0,53.33,Apartamento
3,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,1030.0,16.67,Apartamento
4,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,1618.0,26.00,Apartamento

In [15]:
df.pop('Quartos')

0        1
1        2
2        1
3        1
4        2
        ..
21821    2
21822    0
21823    3
21824    2
21825    2
Name: Quartos, Length: 21826, dtype: int64

In [16]:
df.head()

,Tipo,Bairro,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Tipo Agregado
0,Quitinete,Copacabana,0,0,40,1700.0,500.0,60.0,2260.0,42.50,Apartamento
1,Casa,Jardim Botânico,0,1,100,7000.0,0.0,0.0,7000.0,70.00,Casa
2,Apartamento,Centro,0,0,15,800.0,390.0,20.0,1210.0,53.33,Apartamento
3,Apartamento,Higienópolis,0,0,48,800.0,230.0,0.0,1030.0,16.67,Apartamento
4,Apartamento,Cachambi,0,0,50,1300.0,301.0,17.0,1618.0,26.00,Apartamento

In [17]:
df.drop(['Suites', 'Bairro'], axis=1, inplace=True)

In [18]:
df.head()

,Tipo,Vagas,Area,Valor,Condominio,IPTU,Valor Bruto,Valor m2,Tipo Agregado
0,Quitinete,0,40,1700.0,500.0,60.0,2260.0,42.50,Apartamento
1,Casa,0,100,7000.0,0.0,0.0,7000.0,70.00,Casa
2,Apartamento,0,15,800.0,390.0,20.0,1210.0,53.33,Apartamento
3,Apartamento,0,48,800.0,230.0,0.0,1030.0,16.67,Apartamento
4,Apartamento,0,50,1300.0,301.0,17.0,1618.0,26.00,Apartamento

In [19]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [26]:
eventos = {'m1' : list(m1), 'm2' : list(m2), 'm3' : list(m3), 'm4' : list(m4), 'm5' : list(m5)}
moedas = pd.DataFrame(eventos)
moedas.head()

  m1 m2 m3 m4 m5
0  C  C  C  c  C
1  C  C  c  C  C
2  c  C  c  C  C
3  C  C  C  c  c
4  C  C  C  c  C

In [29]:
df = pd.DataFrame(data=['Cara', 'Coroa'], columns=['Faces'], index=['c', 'C'])
df

   Faces
c   Cara
C  Coroa

In [30]:
for item in moedas:
    df = pd.concat([df,moedas[item].value_counts()], axis=1)
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25